package org.example.chapter03.task07;

public class Main {
    /*
    В этом упражнении вы попробуете выяснить, что происходит, когда метод добавляется в интерфейс.

В Java 7 (которую можно получить из архивов Java) реализуйте класс DigitSequence, который реализует Iterator<Integer>, а не IntSequence. Предоставьте методы hasNext, next и remove, который ничего не делает.

Напишите программу, которая печатает элементы экземпляра.

В Java 8 класс Iterator получил еще один метод — forEachRemaining.

Будет ли ваш код по-прежнему компилироваться при переходе на Java 8?

Если вы поместите свой класс Java 7 в JAR-файл и не перекомпилируете его, будет ли он работать в Java 8?

Что, если вы вызовете метод forEachRemaining?

Также метод remove стал методом по умолчанию в Java 8. Будет ли ваш код по-прежнему компилироваться? Будет ли он работать, если он уже скомпилирован с Java 7?


     */
}
